Revit 2027 API
FootPrintRoof.Offset Property
Retrieve or set the Offset of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double this[
	ModelCurve pCurve
] { get; set; }
Public Property Offset (
	pCurve As ModelCurve
) As Double
	Get
	Set
public:
property double Offset[ModelCurve^ pCurve] {
	double get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, double value);
}
member Offset : float with get, set
Parameters
pCurve ModelCurve
Property Value
Double
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace